"Part1" = "繁體中文";
"Part2" = "APPLE INC.";
"Part3" = "供iOS使用的SHORTCUTS軟體許可協議";
"Part4" = "請先仔細閱讀本軟體許可協議（「許可證」）才使用APPLE軟體。閣下一使用APPLE軟體，即表示同意接受本許可證的條款約束。如閣下不同意本許可證的條款，請勿安裝和/或使用軟體。";
"Part5" = "重要提示:在本軟體可用以複製、修改、發佈和散發材料的範圍內,閣下獲許可只用以複製、修改、發佈和散發沒有著作權的材料、閣下擁有其著作權的材料、授權閣下或合法允許閣下複製、修改、發佈或散發的材料。如閣下不肯定複製、修改、發佈或散發任何材料副本的權利,應聯絡閣下的法律顧問。";
"Part6" = "1. 一般規定。    ";
"Part7" = "A. 本許可證所附的Apple軟體和任何第三方軟體、文件編制、介面、內容、字體及任何資料，不論是存儲於唯讀記憶體、任何其他載體或屬任何其他形式(合稱「Apple軟體」)，是由Apple Inc.(「Apple」)許可閣下使用而非售予閣下，而且閣下只可根據本許可證的條款加以使用，Apple和/或 Apple 的許可人保留對 Apple 軟體本身的所有權，以及保留一切並未明確授予閣下的權利。";
"Part8" = "B. Apple可對閣下Apple品牌相容的iOS裝置的Apple 軟體酌情提供未來升級或更新版本，Apple 軟體升級和更新版本(如有的話)未必包含Apple就較新版本或其它型號iOS裝置發行的所有現有軟體功能或新的功能。本許可證的條款將監管由 Apple 就原先 Apple 軟體產品提供的任何軟體升級或更新版本，除非該升級或更新版本另外連同獨立許可證，在此情況下，閣下同意以該許可證監管該升級或更新版本。";
"Part9" = "2.  允許的許可證用途和限制。    ";
"Part10" = "A. 許可證。在必須遵守本許可證條款和條件以及須得到Apple媒體服務條款和條件(https://www.apple.com/legal/internet-services/itunes/)所列的「服務和內容使用規則」 (「使用規則」)允許的情況下, 除非閣下是如第2B條所述獲取Apple 軟體的，否則閣下獲授予有限的、不可轉讓的非獨家許可證，以在由閣下擁有或控制的、任何相容的Apple品牌iOS裝置上，安裝和使用Apple軟體。閣下不得在網路上分發或提供Apple軟體，以致Apple軟體在同一時間可供多台裝置使用。閣下不得出租、租賃、出借、出售、再分發或再許可Apple 軟體。";
"Part11" = "B. 批量或維修許可證。如閣下是通過與Apple簽訂批量或維修許可證計畫獲取Apple軟體，閣下的批量或維修許可證條款將決定允許閣下在由閣下擁有或控制的Apple品牌iOS裝置上下載、安裝、使用和運行的Apple軟體副本的份數。除Apple書面同意外，本許可證所有其他條款和條件均適用於閣下根據批量或維修許可證獲取Apple軟體的使用。 ";
"Part12" = "C. 系統要求。只有符合Apple指定系統要求的Apple品牌硬體，才會支援Apple軟體。 ";
"Part13" = "D. 內容和數位材料。通過Apple軟體顯示或訪問的任何內容（包括商標、標誌和影像），其所有權和智慧財產權屬於相關的內容所有權人。此等內容可能受著作權、商標或其他智慧財產權法律和條約保護，及可能須遵守提供該等內容的第三方使用條款。除本許可證另有規定外，(i) 本許可證並不授予閣下使用該等內容的任何權利，亦不保證該等內容將繼續提供給閣下，以及 (ii)閣下不得以商業或其他方式獨立使用、提取或分發Apple軟體所包含或作為其一部分提供的任何圖片、標誌、文字、代碼、影像、圖形、藝術作品、音訊、視訊或類似資產 (「數位材料」)，或以其他方式在Apple軟體預定用途情況以外使用數位材料。 ";
"Part14" = "E. 使用Shortcut。閣下承認操作所有應用程式和/或網站的快捷方式（「Shortcut」），均由此類Shortcut源自的一方或多方獨自負責。Apple無法控制任何第三方Shortcut的內容或功能，也不對此承擔任何責任。閣下使用任何Shortcut須自擔風險，並須獨自負責遵守因閣下使用任何Shortcut而產生的任何第三方條款或協議。閣下承認Apple沒有義務預先篩選Shortcut，但Apple保留自行酌情決定預先篩選、拒絕、禁用或刪除任何Shortcut的權利。 ";
"Part15" = "F. 共享Shortcut。 Apple軟體可讓閣下通過網站連結與他人共享閣下創建的Shortcut。閣下的共享Shortcut及其中嵌入的任何內容將存儲在Apple伺服器上，以實現此類共享，並可用於總體改善Apple的產品和服務。閣下的共享Shortcut及其中嵌入的任何內容，將提供給可以訪問該網站連結的任何人使用，然後他們可以複製、保存、修改和再分發閣下Shortcut一份副本，以及其中嵌入的所有內容。與他人共享Shortcut，即意味閣下表示：（1）閣下擁有此類Shortcut的所有必要權利和許可，並且該Shortcut不會侵犯或違反任何他方權利; 和（2）閣下與他人共享的任何Shortcut，不會違反任何法律、促成或鼓勵侵權或其他形式的非法、或在其他方面淫穢或令人反感的行為。閣下承認Apple沒有義務審查閣下與他人共享的任何Shortcut，但Apple保留自行酌情決定審查、禁用或刪除閣下與他人共享任何Shortcut的權利。  ";
"Part16" = "G. 使用限制。閣下同意不會：上傳、發佈、以電子郵件方式發送、傳輸、與他人共享或以其他方式提供任何以下Shortcut：（1）非法、侵權、誹謗、粗俗、淫穢、中傷、或在種族、民族或其他方面令人反感的Shortcut; （2）違反、或鼓勵任何可能違反任何適用法律或法規、或可能引起民事責任的行為的Shortcut; （3）宣揚歧視、偏見、種族歧視、仇恨、騷擾或傷害任何個人或群體的Shortcut; （4）暴力或威脅、或宣揚威脅任何他人的暴力或行為的Shortcut;（5）宣揚非法或有害活動的Shortcut;或（6）閣下知道或相信其為虛假、誤導、欺詐、或以任何方式欺騙其使用者的Shortcut。閣下進一步同意，不會干擾或擾亂連接到閣下iOS裝置上的Apple軟體或任何第三方軟體應用程式、服務或網站（「第三方App 」）的伺服器或網路、或對其造成不應有的負擔、或違反此類網路或第三方App的政策或程序。";
"Part17" = "H. 第三方App。為了完成某些Shortcut，Apple軟體可能需要訪問某些第三方App。在有必要使用Apple軟體以完成Shortcut的範圍內，閣下明確同意並授權Apple軟體代表閣下訪問和使用這些第三方App。在Apple軟體訪問任何第三方App的範圍內，Apple沒有須為此類第三方App提供任何技術或其他支援的明示或默示義務。對於與其軟體、服務、網站和/或產品有關的技術支援和客戶服務，請直接聯繫相應的軟體供應商、製造商或服務提供商。閣下進一步同意，在使用APPLE軟體時，閣下須受這些第三方APP的所有適用服務條款或其他協議約束，並同意予以遵守。對於SHORTCUT使用的每一個第三方APP，閣下須自行負責確保所有SHORTCUT均遵守其適用條款。APPLE不在任何方面保證SHORTCUT遵守任何第三方APP的條款，對於任何第三方SHORTCUT，APPLE不承擔任何責任。 ";
"Part18" = "I. 不得倒序製造。閣下不得且閣下同意不會或讓其他人複製(本許可證或如適用於閣下的使用規則明示允許除外)、反彙編、倒序製造、拆裝、企圖匯出其原始程式碼、解碼、修改Apple軟體或創建其衍生作品、或Apple軟體提供的任何服務或其任何部分（適用法律禁止任何前述限制除外，或包括在Apple軟體內的開放源組件使用許可證條款允許除外）。";
"Part19" = "J.  遵守法律。閣下同意使用Apple軟體和服務（定義見以下第4條）須遵守所有適用法律，包括在閣下居住或在閣下下載或使用Apple軟體和服務的國家或地區的當地法律。";
"Part20" = "K. 自動更新。 如閣下選擇允許自動更新app，閣下的裝置會就Apple軟體的更新版本和升級版本向Apple定期查詢。如有提供更新版本或升級版本，該更新版本或升級版本會自動下載和安裝到閣下的裝置上，以及閣下的週邊裝置（如適用）。任何時候閣下均可完全關閉自動更新app，只需更改Settings項下的自動更新app設定。";
"Part21" = "3. 同意使用資料。";
"Part22" = "A.分析資料。如閣下選擇收集分析資料，閣下同意Apple及其子公司和代理可以收集、維護、處理和使用診斷性、技術性、使用及相關資訊， 包括但不限於定期搜集獨特的系統或硬體識別碼、關於閣下的iOS裝置、電腦、系統和應用軟體以及週邊設備的資訊，以便提供和改善Apple的產品和服務、向閣下提供與Apple軟體有關的軟體更新、產品支援和其他服務(如果有) ，以及用以核實本許可證條款的遵守情況。Apple可基於上述目的使用此等資訊，只要其收集形式不會將閣下本人識別出來。為便於Apple的夥伴和第三方開發者改善其設計配合Apple產品使用的軟體、硬體和服務，Apple並可向任何此類夥伴或第三方開發者提供與該夥伴或第三方開發者的軟體、硬體和/或服務有關的診斷資訊子集，只要診斷資訊的形式不會將閣下本人識別出來。";
"Part23" = "B. 定位資料。Apple及其夥伴、被許可人和第三方開發者可能通過Apple 軟體提供依賴定位資訊的某些服務。為提供和改善這些服務，Apple及其夥伴、被許可人和第三方開發者可能傳輸、收集、維護、處理和使用閣下的定位資料（如有）。Apple收集定位資料和查詢的方式不會將閣下本人識別出來，並可由Apple及其夥伴、被許可人和第三方開發者用以提供和改善基於定位的產品和服務。閣下使用任何由或通過Apple軟體提供的基於定位的服務，即表示同意和允許Apple及其夥伴、被許可人和第三方開發者傳輸、收集、維護、處理和使用閣下的定位資料和查詢，以便提供和改善這些產品和服務。閣下可隨時撤銷此項允許，只需前往閣下iOS裝置上的定位服務設定並關掉全球定位服務設定，或關掉Apple軟體的個別定位設定。在iOS裝置上使用使用或提供定位資料的第三方應用程式或服務時，閣下須遵守並應查閱此類第三方應用程式或服務對於使用定位資料的第三方條款和隱私政策。 ";
"Part24" = "C. 隱私政策。任何時候，閣下的資訊將會依照Apple的隱私政策處理，該政策可在https://www.apple.com/legal/privacy/ 查閱。";
"Part25" = "4. 服務和第三方材料。";
"Part26" = "A. 一般規定。Apple軟體能使閣下訪問Apple的iTunes Store、App Store、iCloud、地圖及其它Apple和第三方服務及網站(以下統稱及個別稱為「服務」)。該等服務不會以所有語言或在所有國家地區提供。使用這些服務需要接入互聯網，而且使用某些服務可能需要一個Apple ID，可能要求閣下接受附加服務條款和條件，並可能須繳交附加費用。閣下就iTunes Store帳戶、Apple ID或其他Apple服務使用本軟體，即表示同意接受該服務的適用服務條款(例如Apple媒體服務最新的條款和條件)，閣下可在https://www.apple.com/legal/internet-services/itunes/ 訪問和查閱該等條款和條件。";
"Part27" = "B. 如閣下選擇通過Apple軟體使用iCloud服務，該等使用須遵守以下的額外條款：iCloud條款和條件，可在https://www.apple.com/legal/internet-services/icloud/查閱；和Apple的隱私政策，可在 https://www.apple.com/legal/privacy/ 查閱。";
"Part28" = "C. 閣下明白，使用任何服務意味閣下或會遇到可能被視為冒犯性、猥褻或討厭的內容，這些內容可能使用或不使用直白的語言。儘管如此，閣下同意使用服務並自擔風險，對於可能被發現屬冒犯性、猥褻或討厭的內容，Apple不向閣下承擔任何責任。";
"Part29" = "D. 某些服務可能顯示、包含或提供來自第三方的服務、內容、資料、資訊、應用程式或材料( 「第三方材料」)，或提供至某些第三方網站或應用程式的鏈結。閣下一使用服務，即表示閣下承認並同意，Apple不負責檢查或評估此等第三方材料、應用程式或網站的內容、準確性、完整性、及時性、有效性、符合版權規定、合法性、適當性或品質，或任何其他方面。對任何第三方服務、第三方材料、應用程式或網站，或者第三方的任何其他材料、產品或服務，Apple 及其管理人員、關聯公司和子公司不作任何保證或認可，亦不對閣下或任何其他人承擔和負有任何責任或負責。第三方材料和至其他網站或應用程式的鏈結僅為方便閣下而提供。";
"Part30" = "E. 在閣下使用服務上傳任何內容的範圍內，閣下聲明閣下擁有所有權利或得到授權或以其他方式獲法律允許上傳該等內容，以及該等內容不違反適用於服務的任何服務條款。閣下同意，服務含有屬Apple、網站所有人和/或其許可人擁有的專有內容、資訊和材料（包括但不限於任何數位材料），受適用的智慧財產權和其他法律保護，包括但不限於版權。閣下同意除服務的允許用途外，閣下不會使用此等專有內容、資訊或材料,也不以任何與本許可證的條款不一致或侵犯第三方或Apple的任何知識產權的方式使用此等專有資訊或材料。服務的任何部分，皆不得以任何形式或以任何方式複製。閣下同意不以任何方式修改、出租、租賃、借出、銷售或分發服務，亦不以任何方式以服務為基礎創作任何衍生作品。閣下不得以任何未獲授權的方式利用服務，包括但不限於使用服務傳播電腦病毒、蠕蟲、特洛伊木馬或其他惡意軟體,或者侵入網路或加重網路容量負擔。閣下進一步同意不以任何方式使用服務騷擾、辱罵、追蹤、威脅或誹謗任何其他方,或以侵犯或違反任何其他方權利的方式使用服務。對於閣下的任何此等使用或由於使用服務致使閣下可能收到的任何騷擾性、威脅性、誹謗性、冒犯性、侵權或非法資訊或傳播,Apple不在任何方面對閣下承擔任何責任。";
"Part31" = "F. 此外，通過Apple軟體訪問、鏈結或顯示的服務和第三方材料不會以所有語言或在所有國家或地區提供。Apple不聲明此等服務和第三方材料為適當的及可在任何特定地點提供使用。在閣下選擇使用或訪問此等服務和第三方材料的範圍內，閣下是自主決定這樣做的，並負責遵守任何適用法律，包括但不限於適用的地方法律，以及隱私和資料收集法律。Apple及其許可人保留在不通知的情況下，隨時更改、暫停、取消或禁止訪問任何服務的權利。在任何情況下，Apple皆不對取消或禁止訪問任何此等服務負有責任。Apple還可在任何情況下，不通知和不承擔責任地限制使用或訪問某些服務。 ";
"Part32" = "5. 終止。   本許可證維持有效，直至終止之時為止。如閣下並未遵守本許可證任何條款，閣下在本許可證的權利將立即終止或以其他方式停止生效，Apple不會另行通知。本許可證終止時，閣下應停止使用一切Apple軟體及銷毀所有複製Apple軟體的全部或部分的複製本。本許可證第2I、3、4、5、6、7、8、10和11條在如此終止後繼續有效。";
"Part33" = "6. 不作出保證。    ";
"Part34" = "A. 如閣下是消費者客戶(指在閣下的行業、業務或專業以外使用Apple軟體的人) ,閣下在居住國可能享有法定權利,禁止以下限制適用於閣下。這些限制若被禁止即不適用於閣下。要進一步 瞭解相關的消費者權利,閣下應聯繫當地的消費者諮詢組織。";
"Part35" = "B. 閣下明示承認和同意，在適用法律允許的範圍內，閣下使用APPLE軟體和和通過APPLE軟體執行或訪問的任何服務須自行承擔風險，而且有關質量滿意、性能、準確性及努力等方面的全部風險均由閣下承擔。";
"Part36" = "C. 在適用法律允許的最大範圍內，APPLE軟體和服務是「按現狀」和「可提供情況」提供的，附有一切故障而不帶有任何種類的保證；APPLE和APPLE的許可人(在第6和7條中合稱為「APPLE」)特此否認就APPLE軟體和服務作出任何明示、默示或法定保證和條件，包括但不限於有關適銷性、質量滿意、適合作某特定用途、準確性、不受幹擾地享用及不侵害第三方權利的默示保證和／或條件。";
"Part37" = "D. APPLE並不保證閣下可不受幹擾地享用APPLE軟體和服務，APPLE軟體包含的功能或所執行或提供的服務會符合閣下的要求，APPLE軟體或服務將不受幹擾地操作而且毫無錯誤、任何服務將持續提供、APPLE軟體或服務將被糾正、或APPLE軟體可與任何第三方軟體、應用程式或第三方服務相容或共同運作。安裝本APPLE軟體可能影響第三方軟體、應用程式或第三方服務以及APPLE產品和服務的可得性及可用性。";
"Part38" = "E. 閣下進一步承認，APPLE軟體和服務並非專為用於若APPLE軟體或服務出現故障或時間延誤、或所提供的內容、資料或資訊出現錯誤或不準確之處時，可能會導致人身傷亡或嚴重的有形或環境損害的情況或環境，包括但不限於操作核子設施、飛機導航或通信系統、空中交通管制系統、生命維持機器或武器系統。";
"Part39" = "F. APPLE或APPLE授權代表給予的口頭或書面資料或意見均不構成任何保證。如發現APPLE軟體或服務有缺陷，閣下須承擔所有必要的維修、修理或糾正的全部費用。有些國家地區不允許排除默示保證或對消費者的適用法定權利加以限制的做法，因此上述排除和限制可能並不適用於閣下。";
"Part40" = "7. 責任限制。    在適用法律並未禁止的範圍內，在任何情況下，對由於閣下使用或無法使用APPLE軟體和服務、或與APPLE軟體共同使用或無法共同使用任何第三方軟體或應用程式所引起或與此有關的任何人身傷害或任何附帶的、特別的、間接的或後果性的損害賠償，包括但不限於利潤損失、資料損壞或損失、未能傳輸或接收任何資料、業務中斷的損害賠償或任何其他商業損害賠償或損失，無論其成因及基於哪一種責任理論(合同、侵權法或其他)，APPLE概無須負責，即使APPLE已知悉可能發生上述損害賠償。有些國家地區不允許對人身傷害，或附帶或後果性損害賠償排除或附加責任限制，因此此項限制可能並不適用於閣下。在任何情況下，Apple就所有損害賠償對閣下承擔的全部責任(除在涉及人身傷害的情況中根據適用法律規定的損害賠償外)不應超過五十美元(US$50.00)。即使前述補救方法失去其主要作用，上述限制仍將適用。";
"Part41" = "8. 出口控制。    除美國法律及獲得Apple軟體的所在國家地區的法律授權外，閣下不得使用或以任何方式出口或轉口Apple軟體。特別是(但不以此為限) Apple軟體不得出口或轉口 (a) 到任何遭美國禁運的國家，或 (b) 給美國財政部的特別指定國民名單或美國商務部的被禁人士或機構名單或任何其他受限制方名單上任何人士。閣下使用Apple軟體，即表示閣下聲明和保證閣下並非位於上述任何國家，或列入上述任何名單。閣下並同意不會使用Apple軟體於美國法律禁止使用的任何目的，包括但不限於發展、設計、製造或生產導彈、核武器或化學或生物武器。";
"Part42" = "9. 政府最終用戶。  Apple 軟體和有關文件均屬「商業項目」，該詞定義見 48 C.F.R. §2.101，包含「商用電腦軟體」和「商用電腦軟體文件」，定義見 48 C.F.R.§12.212 或 48 C.F.R.§227.7202，以適用者為準。在符合 48 C.F.R.§12.212 或 48 C.F.R.§227.7202-1 至 227.7202-4 (以適用者為準) 的規定下，商用電腦軟體和商用電腦軟體文件(a)只作為商業項目許可美國政府最終用戶使用，及(b)只附有根據本許可證條款和條件授予所有其他最終用戶的權利。Apple 根據美國的著作權法律保留任何未經發布的權利。";
"Part43" = "10. 管轄法律和可分割性。    本許可證受美國加利福尼亞州法律管轄並按該等法律解釋，但其法律衝突原則除外。本許可證不受《聯合國國際貨物銷售合同公約》管轄，並明確排除該公約的適用。如閣下是英國消費者，本許可證將受對閣下居住國家地區具司法管轄權的法律管轄。如具有合法管轄權的法院因故裁定本許可證任何條款或其任何部分不能執行，本許可證其餘條款或部分應繼續充分有效。";
"Part44" = "11. 全部協議；管轄文字。    本許可證構成閣下與Apple之間有關Apple軟體的全部協議，並取代與該標的事項有關的以前或現在的所有共識。本許可證的修訂或修改須經Apple簽署書面文件才具有約束力。本許可證的任何譯本只為當地需要而設，如英文本與任何非英文譯本有任何不一致之處，在閣下所在國家地區當地法律不禁止的範圍內，應以本許可證的英文本為準。 ";
"Part45" = "12. 第三方確認。    Apple軟體的若干部分可能使用或包含第三方的軟體及其它享有著作權的材料。Apple軟體所附的電子檔中載明有關該等材料的確認、許可條款及不承擔責任聲明，閣下對該等材料的使用受有關的條款管轄。";
"Part46" = "EA1576";
"Part47" = "2018年8月16日";